In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [6]:
ny_data = pd.read_csv('AB_NYC_2019.csv')
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(ny_data)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [10]:
# PRICE IN BROOKLYN VS MANHATTAN
nbhd = ny_data[['neighbourhood_group', 'price']]
nbhd

      neighbourhood_group  price
0                Brooklyn    149
1               Manhattan    225
2               Manhattan    150
3                Brooklyn     89
4               Manhattan     80
...                   ...    ...
48890            Brooklyn     70
48891            Brooklyn     40
48892           Manhattan    115
48893           Manhattan     55
48894           Manhattan     90

[48895 rows x 2 columns]

In [14]:
ny_data['neighbourhood_group']['Brooklyn'].mean()

8663742.498321472